AITT-VN/ohstem_arduino_board/ohstem_esp32-2.0.2/boards.txt
menu.UploadSpeed=Upload Speed
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

yolobit.name=YoloBit

yolobit.upload.tool=esptool_py
yolobit.upload.maximum_size=1310720
yolobit.upload.maximum_data_size=327680
yolobit.upload.flags=
yolobit.upload.extra_flags=

yolobit.serial.disableDTR=true
yolobit.serial.disableRTS=true

yolobit.build.tarch=xtensa
yolobit.build.bootloader_addr=0x1000
yolobit.build.target=esp32
yolobit.build.mcu=esp32
yolobit.build.core=esp32
yolobit.build.variant=yolobit
yolobit.build.board=yolobit

yolobit.build.f_cpu=240000000L
yolobit.build.flash_size=4MB
yolobit.build.flash_freq=40m
yolobit.build.flash_mode=dio
yolobit.build.boot=dio
yolobit.build.partitions=default
yolobit.build.defines=
yolobit.build.extra_libs=

yolobit.menu.PSRAM.enabled=Enabled
yolobit.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
yolobit.menu.PSRAM.enabled.build.extra_libs=
yolobit.menu.PSRAM.disabled=Disabled
yolobit.menu.PSRAM.disabled.build.defines=
yolobit.menu.PSRAM.disabled.build.extra_libs=

yolobit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
yolobit.menu.PartitionScheme.default.build.partitions=default
yolobit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
yolobit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
yolobit.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
yolobit.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
yolobit.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
yolobit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
yolobit.menu.PartitionScheme.minimal.build.partitions=minimal
yolobit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
yolobit.menu.PartitionScheme.no_ota.build.partitions=no_ota
yolobit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
yolobit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
yolobit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
yolobit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
yolobit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
yolobit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
yolobit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
yolobit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
yolobit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
yolobit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
yolobit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
yolobit.menu.PartitionScheme.huge_app.build.partitions=huge_app
yolobit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
yolobit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
yolobit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
yolobit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
yolobit.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
yolobit.menu.PartitionScheme.fatflash.build.partitions=ffat
yolobit.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
yolobit.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
yolobit.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
yolobit.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
yolobit.menu.PartitionScheme.rainmaker=RainMaker
yolobit.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
yolobit.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

yolobit.menu.FlashFreq.80=80MHz
yolobit.menu.FlashFreq.80.build.flash_freq=80m
yolobit.menu.FlashFreq.40=40MHz
yolobit.menu.FlashFreq.40.build.flash_freq=40m

yolobit.menu.UploadSpeed.921600=921600
yolobit.menu.UploadSpeed.921600.upload.speed=921600
yolobit.menu.UploadSpeed.115200=115200
yolobit.menu.UploadSpeed.115200.upload.speed=115200
yolobit.menu.UploadSpeed.256000.windows=256000
yolobit.menu.UploadSpeed.256000.upload.speed=256000
yolobit.menu.UploadSpeed.230400.windows.upload.speed=256000
yolobit.menu.UploadSpeed.230400=230400
yolobit.menu.UploadSpeed.230400.upload.speed=230400
yolobit.menu.UploadSpeed.460800.linux=460800
yolobit.menu.UploadSpeed.460800.macosx=460800
yolobit.menu.UploadSpeed.460800.upload.speed=460800
yolobit.menu.UploadSpeed.512000.windows=512000
yolobit.menu.UploadSpeed.512000.upload.speed=512000


##############################################################

xcontroller.name=xController

xcontroller.upload.tool=esptool_py
xcontroller.upload.maximum_size=1310720
xcontroller.upload.maximum_data_size=327680
xcontroller.upload.flags=
xcontroller.upload.extra_flags=

xcontroller.serial.disableDTR=true
xcontroller.serial.disableRTS=true

xcontroller.build.tarch=xtensa
xcontroller.build.bootloader_addr=0x1000
xcontroller.build.target=esp32
xcontroller.build.mcu=esp32
xcontroller.build.core=esp32
xcontroller.build.variant=xcontroller
xcontroller.build.board=xcontroller

xcontroller.build.f_cpu=240000000L
xcontroller.build.flash_size=4MB
xcontroller.build.flash_freq=40m
xcontroller.build.flash_mode=dio
xcontroller.build.boot=dio
xcontroller.build.partitions=default
xcontroller.build.defines=
xcontroller.build.loop_core=
xcontroller.build.event_core=

xcontroller.menu.PSRAM.disabled=Disabled
xcontroller.menu.PSRAM.disabled.build.defines=
xcontroller.menu.PSRAM.disabled.build.extra_libs=
xcontroller.menu.PSRAM.enabled=Enabled
xcontroller.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
xcontroller.menu.PSRAM.enabled.build.extra_libs=

xcontroller.menu.FlashFreq.80=80MHz
xcontroller.menu.FlashFreq.80.build.flash_freq=80m
xcontroller.menu.FlashFreq.40=40MHz
xcontroller.menu.FlashFreq.40.build.flash_freq=40m

xcontroller.menu.UploadSpeed.921600=921600
xcontroller.menu.UploadSpeed.921600.upload.speed=921600
xcontroller.menu.UploadSpeed.115200=115200
xcontroller.menu.UploadSpeed.115200.upload.speed=115200
xcontroller.menu.UploadSpeed.256000.windows=256000
xcontroller.menu.UploadSpeed.256000.upload.speed=256000
xcontroller.menu.UploadSpeed.230400.windows.upload.speed=256000
xcontroller.menu.UploadSpeed.230400=230400
xcontroller.menu.UploadSpeed.230400.upload.speed=230400
xcontroller.menu.UploadSpeed.460800.linux=460800
xcontroller.menu.UploadSpeed.460800.macosx=460800
xcontroller.menu.UploadSpeed.460800.upload.speed=460800
xcontroller.menu.UploadSpeed.512000.windows=512000
xcontroller.menu.UploadSpeed.512000.upload.speed=512000

##############################################################
